/*
	声明变量let和const
*/

// let声明的变量不存在预解析
// console.log(flag);
// let flag = 456;

// --------------------------

// let声明的变量不允许重复(在同一个作用域内)
// let flag = 123;
// let flag = 456;
// console.log(flag);

// --------------------------

// ES6引入了块级作用域
// 块内部定义的变量，再外部是不可以访问
// if(true) {
// 	let flag = 123;
// }
// console.log(flag);

// --------------------------

// 在块级作用域内部，变量只能先声明再使用
// if(true) {
// 	console.log(flag);
// 	let flag = 123;
// }

// --------------------------
// --------------------------
// const用来声明常量
// const声明的常量不允许重新赋值
// const声明的常量必须初始化